#include <iostream>

int main() {
    unsigned char array[12] = {0b00010010, 0b00110100, 0b01010110, 0b01111000, 0b10011010, 0b10111100, 0b11011110, 0b11110000, 0b00100011, 0b01000101, 0b01100111, 0b10001001 };
    int count = 0;

    for (int i = 0; i < 12; i++) {
        if ((array[i] & (1 << 1)) == 0 && (array[i] & (1 << 5)) == 0) {
            count++;
        }
    }

    std::cout << "Количество элементов массива, двоичные коды которых содержат 0 в битах 1 и 5: " << count << std::endl;
    return 0;
}
